
[
    {
      "id": 1,
      "title": "Dear Ahmed",
      "description": "These past 16 months with you have been the most beautiful, precious, and unforgettable part of my life. Every single day with you—even if we’re apart—has been filled with so much love, warmth, and happiness that I didn’t even know was possible. You’ve become my peace, my joy, and my greatest blessing. I love you more than words could ever express, more than my heart can even contain. The way you make me feel is something I wouldn’t trade for anything in this world. You’re my everything, Ahmed, and I thank Allah every day for bringing you into my life."

    },
    {
      "id": 2,
      "title": "My love",
      "description": "I love you so much that I wouldn’t think twice before giving my life for you. You mean more to me than my own existence. Just the thought of you brings tears to my eyes because my heart aches to be with you, to hold you, to feel your presence beside me. I want us to be together so badly—I want to hug you, to look into your eyes, to hear your voice whisper that you’re mine. I want to be the one who stands by you through everything, who loves you unconditionally, who makes you as happy as you’ve made me. Please, my love, never doubt how deeply and completely I am yours."

    },
    {
      "id": 3,
      "title": "Meri Jaan",
      "description": "I pray to Allah every single day, with every beat of my heart, that He brings us together soon. I pray from Him to unite us in the most beautiful, halal way—under the blessings of nikah, as husband and wife, as soulmates destined for each other. Ahmed, please don’t make me wait too long. Please take me as yours forever. I want to be your wife, your partner, your companion in this life and the next. I want to wake up every morning knowing I belong to you, and you belong to me. The thought of being yours officially, in the eyes of Allah and the world, is the only dream I have left."

    },
    {
      "id": 4,
      "title": "Mera Sab Kuch",
      "description": "Please, my love, accept me. Let me love you the way you deserve—fully, passionately, and without hesitation. Let me be the one who stands by you through every hardship and celebrates every joy with you. I promise you, with all my heart and soul, that I will spend the rest of my life making you happy. Just say the word, and I am yours. Until then, I will wait, no matter how hard it gets, because you are worth every second of the wait. I love you, Ahmed, today, tomorrow, and forever. ♡"
    }

  ]